/*
يا أهلًا بيكم يا أبطال 🌟❤️ يارب تكونوا بخير..
زمان كان كل بيت فيه "أجندة" كدا مجمع فيها أرقام التليفونات الأرضي للأهل والأصدقاء.. النهاردة وبعد ما اتعلمنا الـ 
CRUD Operations عايزين نعمل نفس الفكرة بس بشكل 
Web App 
عصري (أكيد مش هنجيب أجندة 😂).
فالنهاردة ميعادنا مع: 🎉 Assignment 9 : ContactHub 🎉
🎯 المطلوب:
 1️⃣ المستخدم يقدر يضيف (Add)، يعدل (Update)، أو يحذف (Delete) أي Contact. 
2️⃣ يقدر يبحث عن أي Contact عن طريق الـ Name أو الـ Phone أو حتى الـ Email.
 3️⃣ يقدر يضيف أو يحذف أي Contact من قائمة المفضلات (Favorites). 

4️⃣ تفعيل الـ Action Buttons:
أيقونة 📞: عند الضغط عليها تقوم بالاتصال (تستخدم href="tel:...").

أيقونة ✉️: عند الضغط عليها تفتح تطبيق الإيميل (تستخدم href="mailto:...").

 5️⃣ متنساش الـ Validation**؛ تأكد إن البيانات مكتوبة بشكل صحيح قبل الإضافة. 


6️⃣ طبعا متنساش تستخدام **LocalStorage عشان البيانات متضعش لما نعمل Reload للصفحة.



و أخيرا تقدر تشوف الـ Design المطلوب من هنا: https://tinyurl.com/contacthub-route


✨ Hints:

 ✅ مجرد ما بتضغط علي Add Contact button
 بيظهرلك Modal 

تقدر تعمله بنفسك عن طريق انك هتعمل الـ Design



 في الـ HTML


 عادى و تديله display: none 

ولما تضغط علي Add contact


 تشيل الـ display: none فيظهر معاك.


. او انك تسخدم الـ Modal
الموجود في الـ Bootstrap.



✅ لما تضيف contact 


هتلاقي بيظهرلك Alert 

جميل كدا كذلك الحال لما تعدل أى contact


 أو حتى لما بتيجي تحذف مش بيحذف بشكل مباشر لا بيظهر الأول confirmation alert 



اللى هو انت متأكد ؟ عايز تحذف فعلا ؟



 لو ضغطت Delete ساعتها بس هيحذف كل دا بيتعمل عن طريق مكتبة اسمها SweatAlert هسيبلك اللينك بتاعها من هنا: https://sweetalert2.github.io/
⏳ **الديدلاين:  الثلاثاء الساعة ١٠ م 
موفقين إن شاء الله وأشوف إبداعكم ❤️🥰



*/